wkxboot/nrf51_sdk_v6_1_0_0/nRF51 SDK_v6.1.0.0/Nordic/nrf51822/Board/JJDK_ZG_ZK/s110/bel_app_smart_locker/main.c
static void sys_evt_dispatch(uint32_t sys_evt);
static uint32_t ble_sls_notify_device_info( ble_sls_t *p_sls,uint16_t value_handle,uint8_t *ptr_data,uint16_t data_len);

/*****************************************************************************
* Error Handling Functions
*****************************************************************************/


/**@brief Function for error handling, which is called when an error has occurred. 
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze 
 *          how your product is supposed to react in case of error.
 *
 * @param[in] error_code  Error code supplied to the handler.
 * @param[in] line_num    Line number where the handler is called.
 * @param[in] p_file_name Pointer to the file name. 
 */
void app_error_handler(uint32_t error_code, uint32_t line_num, const uint8_t * p_file_name)
{
    // This call can be used for debug purposes during application development.
    // @note CAUTION: Activating this code will write the stack to flash on an error.
    //                This function should NOT be used in a final product.
    //                It is intended STRICTLY for development/debugging purposes.
    //                The flash write will happen EVEN if the radio is active, thus interrupting
    //                any communication.
    //                Use with care. Un-comment the line below to use.
    // ble_debug_assert_handler(error_code, line_num, p_file_name);

    // On assert, the system can only recover with a reset.
    NVIC_SystemReset();
}


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze 
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}




/*****************************************************************************
* Static Timeout Handling Functions
*****************************************************************************/

/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *          This function will start the ADC.
 *
 * @param[in]   p_context   Pointer used for passing some arbitrary information (context) from the
 *                          app_start_timer() call to the timeout handler.
 */
static void battery_level_meas_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    battery_start();
}


///**@brief Function for handling the Heart rate measurement timer timeout.
// *
// * @details This function will be called each time the heart rate measurement timer expires.
// *          It will exclude RR Interval data from every third measurement.
// *
// * @param[in]   p_context   Pointer used for passing some arbitrary information (context) from the
// *                          app_start_timer() call to the timeout handler.
// */
//static void heart_rate_meas_timeout_handler(void * p_context)
//{
//    uint32_t err_code;

//    UNUSED_PARAMETER(p_context);

//    err_code = ble_hrs_heart_rate_measurement_send(&m_hrs, m_cur_heart_rate);

//    if (
//        (err_code != NRF_SUCCESS)
//        &&
//        (err_code != NRF_ERROR_INVALID_STATE)
//        &&
//        (err_code != BLE_ERROR_NO_TX_BUFFERS)
//        &&
//        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
//    )
//    {
//        APP_ERROR_HANDLER(err_code);
//    }
//}

static void app_send_device_info_timeout_handler(void * p_context)
{
	uint32_t err_code;
	UNUSED_PARAMETER(p_context);
	
	DEBUG_INFO("\r\nuv_lamp_cmd->");
	DEBUG_INFO(uint8_to_string(uv_lamp_cmd));
	
	DEBUG_INFO("\r\nuv_lamp_status->");
	DEBUG_INFO(uint8_to_string(uv_lamp_status));
	
	DEBUG_INFO("\r\nuv_lamp_door_status->");
	DEBUG_INFO(uint8_to_string(uv_lamp_door_status));
	
	DEBUG_INFO("\r\nfan_negative_ion_cmd->");
	DEBUG_INFO(uint8_to_string(fan_negative_ion_cmd));
	
	DEBUG_INFO("\r\nfan_negative_ion_status->");
	DEBUG_INFO(uint8_to_string(fan_negative_ion_status));
	
	DEBUG_INFO("\r\nelec_lock_cmd->");
	DEBUG_INFO(uint8_to_string(elec_lock_cmd));
	
	DEBUG_INFO("\r\nelec_lock_status->");
	DEBUG_INFO(uint8_to_string(elec_lock_status));
		
	err_code=ble_sls_notify_device_info(&m_sls,(&m_sls)->uv_lamp_cmd_handles.value_handle,&uv_lamp_cmd,1);
	if(err_code!=NRF_SUCCESS)
	{
		DEBUG_INFO("\r\nnotify failed!uv_lamp_cmd!");
	}
	else
	{
	  DEBUG_INFO("\r\nnotify successed!uv_lamp_cmd!");	
	}
	err_code=ble_sls_notify_device_info(&m_sls,(&m_sls)->uv_lamp_status_handles.value_handle,&uv_lamp_status,1);
	if(err_code!=NRF_SUCCESS)
	{
		DEBUG_INFO("\r\nnotify failed!uv_lamp_status!");
	}
	else
	{
	  DEBUG_INFO("\r\nnotify successed!uv_lamp_status!");	
	}
	err_code=ble_sls_notify_device_info(&m_sls,(&m_sls)->uv_lamp_door_status_handles.value_handle,(uint8_t*)&uv_lamp_door_status,1);
	if(err_code!=NRF_SUCCESS)
	{
		DEBUG_INFO("\r\nnotify failed!uv_lamp_door!");
	}
	else
	{
	  DEBUG_INFO("\r\nnotify successed!uv_lamp_door!");	
	}
	err_code=ble_sls_notify_device_info(&m_sls,(&m_sls)->fan_negative_ion_cmd_handles.value_handle,(uint8_t*)&fan_negative_ion_cmd,1);
		if(err_code!=NRF_SUCCESS)
	{
		DEBUG_INFO("\r\nnotify failed!fan_negative_ion_cmd!");
	}
	else
	{
	  DEBUG_INFO("\r\nnotify successed!fan_negative_ion_cmd!");	
	}
		err_code=ble_sls_notify_device_info(&m_sls,(&m_sls)->fan_negative_ion_status_handles.value_handle,(uint8_t*)&fan_negative_ion_status,1);
		if(err_code!=NRF_SUCCESS)
	{
		DEBUG_INFO("\r\nnotify failed!fan_negative_ion_status!");
	}
	else
	{
	  DEBUG_INFO("\r\nnotify successed!fan_negative_ion_status!");	
	}
	err_code=ble_sls_notify_device_info(&m_sls,(&m_sls)->elec_lock_cmd_handles.value_handle,(uint8_t*)&elec_lock_cmd,1);
		if(err_code!=NRF_SUCCESS)
	{
		DEBUG_INFO("\r\nnotify failed!elec_lock_cmd");
	}
	else
	{
	  DEBUG_INFO("\r\nnotify successed!elec_lock_cmd!");	
	}
		err_code=ble_sls_notify_device_info(&m_sls,(&m_sls)->elec_lock_status_handles.value_handle,(uint8_t*)&elec_lock_status,1);
		if(err_code!=NRF_SUCCESS)
	{
		DEBUG_INFO("\r\nnotify failed!elec_lock_status");
	}
	else
	{
	  DEBUG_INFO("\r\nnotify successed!elec_lock_status!");	
	}
}

static uint32_t ble_sls_notify_device_info( ble_sls_t *p_sls,uint16_t value_handle,uint8_t *ptr_data,uint16_t data_len)
{
    uint32_t err_code;

    // Send value if connected and notifying
    if (p_sls->conn_handle != BLE_CONN_HANDLE_INVALID && value_handle!= BLE_CONN_HANDLE_INVALID)
    {
			 
